// diplomaData.js
import {
  FaChalkboardTeacher,
  FaRocket,
  FaBriefcase,
  FaPlaneDeparture,
  FaGraduationCap,
  FaLightbulb,
} from "react-icons/fa";

// Introductory text 
export const diplomaIntro = [
  "প্রতিদিন নতুন প্রযুক্তি ও উদ্ভাবনে বিশ্ব এগিয়ে যাচ্ছে। এই পরিবর্তনের সাথে তাল মিলাতে চাইলে ডিপ্লোমা ইন ইঞ্জিনিয়ারিং হতে পারে আপনার সাফল্যের সিঁড়ি। এখানে হাতে-কলমে শেখার মাধ্যমে বাস্তব দক্ষতা অর্জন করা যায়, যা কর্মজীবনে আপনাকে করে তুলবে যোগ্য ও আত্মবিশ্বাসী।",
  "ডিপ্লোমা ইন ইঞ্জিনিয়ারিং একটি চার বছর মেয়াদি কারিগরি শিক্ষা প্রোগ্রাম। এই কোর্সে শিক্ষার্থীরা তাত্ত্বিক ও ব্যবহারিক জ্ঞানের সমন্বয়ে গড়ে ওঠে একজন দক্ষ টেকনোলজিস্ট হিসেবে, যা ভবিষ্যতে কর্মক্ষেত্রে সাফল্যের দ্বার উন্মোচন করে।",
];


// Feature cards data 
export const diplomaFeatures = [
  {
    id: 1,
    icon: FaChalkboardTeacher,
    title: "হাতে-কলমে শিক্ষা",
    desc: "ল্যাব, ওয়ার্কশপ ও প্র্যাকটিক্যাল ক্লাসের মাধ্যমে বাস্তব কাজ শিখে গড়ে ওঠে প্রকৃত দক্ষ ইঞ্জিনিয়ার।",
  },
  {
    id: 2,
    icon: FaRocket, 
    title: "দ্রুত দক্ষতা অর্জন",
    desc: "মাত্র ৪ বছরে আধুনিক প্রযুক্তিগত দক্ষতা অর্জন করে সহজেই চাকরি বা পেশাগত জীবন শুরু করা যায়।",
  },
  {
    id: 3,
    icon: FaBriefcase, 
    title: "দ্রুত চাকরির সুযোগ",
   desc: "সরকারি-বেসরকারি অফিস, শিল্প প্রতিষ্ঠান ও কারখানায় সহজেই চাকরির সুযোগ মেলে।",
  },
  {
    id: 4,
    icon: FaPlaneDeparture,
    title: "বিদেশে কর্মসংস্থান",
    desc: "ডিপ্লোমা ডিগ্রিটি আন্তর্জাতিকভাবে স্বীকৃত, ফলে বিদেশেও উচ্চ বেতনের চাকরির সুযোগ রয়েছে।",
  },
  {
    id: 5,
    icon: FaGraduationCap, 
    title: "উচ্চতর শিক্ষার সুযোগ",
    desc: "ডিপ্লোমা হলো ইঞ্জিনিয়ারিং জীবনের ভিত্তি। এটি উচ্চতর পড়াশোনা ও ক্যারিয়ারের পথ প্রশস্ত করে।",
  },
  {
    id: 6,
    icon: FaLightbulb, 
    title: "উদ্যোক্তা হওয়ার সুযোগ",
    desc: "নিজের Workshop, ব্যবসা, ফ্রিল্যান্সিং বা Consultancy শুরু করে স্বাবলম্বী ও সফল উদ্যোক্তা হওয়া সম্ভব।",
  },
];
